testCases/Cavity/Galbraith/non-ideality-comparison/cavity_stoich_nonIdeal/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         mapFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             0.5;

deltaT              1e-7;

writeControl        adjustableRunTime;

writeInterval       1e-3;

purgeWrite          1;

writeFormat         ascii;

writePrecision      6;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

adjustTimeStep      yes;

maxCo               50;

runTimeModifiable   yes;

functions
{
    probes
    {
        // Where to load it from
        libs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    writeTime;
        writeInterval   1;

        // Fields to be probed
        fields
        (
            C_MG 
        );

        probeLocations
        (
            ( 0.05 0.05 0.005 )
        );
    }
}


// ************************************************************************* //
